Revit 2027 API
AngularDimension.SetAngularRadius Method
 Set radius of an Angular Dimension arc. The new radius of the arc.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetAngularRadius(
	double radius
)
Public Sub SetAngularRadius (
	radius As Double
)
public:
void SetAngularRadius(
	double radius
)
member SetAngularRadius :
        radius : float -> unit
Parameters
radius Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The given value for radius must be non-negative.
See Also
Reference
AngularDimension Class
Autodesk.Revit.DB Namespace